In [198]:
# TODO: adicionar exemplo de loc + lambda

In [199]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

# Pandas

http://pandas.pydata.org/

https://github.com/pandas-dev/pandas/raw/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf

Biblioteca que contém estruturas de dados e ferramentas para análise de dados.

Por default utiliza as estruturas de dados do numpy(arrays), que são otimizadas para processmento de dados.

In [200]:
# alias normalmente utilizados
import pandas as pd
import numpy as np

# Estruturas de dados

Muito do que vai ser visto aqui com as estruturas de dados do Pandas se aplica às estruturas de dados do numpy, que é utilizado por baixo dos panos pelo Pandas.

## Series

http://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.html

Lista de dados associados a labels, denominados *index*.

Outra forma de pensar sobre uma Series é que ela é um dicionário ordenado de tamanho fixo.

In [201]:
serie = pd.Series([1, 5, -10, 9])

serie
# labels default [0, N-1]

0     1
1     5
2   -10
3     9
dtype: int64

In [202]:
serie.values

array([  1,   5, -10,   9])

In [203]:
serie.index

RangeIndex(start=0, stop=4, step=1)

In [204]:
serie = pd.Series(data=[1, 5, -10, 9], # dados
                  index=["a", "c", "d", "g"], # index
                  name="Série legal", # nome da series
                  dtype="int") # tipo dos dados > se não especificado, é inferido

serie.index.name = "letras" # index name

serie

letras
a     1
c     5
d   -10
g     9
Name: Série legal, dtype: int64

In [205]:
serie['g'] # selecionando valor por índice

9

In [206]:
type(serie['g']) # tipo de um valor

numpy.int64

In [207]:
serie[['a', 'g']] # selecionando valores por índices

letras
a    1
g    9
Name: Série legal, dtype: int64

In [208]:
type(serie[['a', 'g']]) # tipo da estrutura com os valores

pandas.core.series.Series

In [209]:
serie['g'] = 10 # update

serie

letras
a     1
c     5
d   -10
g    10
Name: Série legal, dtype: int64

In [210]:
'g' in serie # pertinência

True

### Instanciando

http://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.html#pandas.Series

**dtypes**:
* int8, int16, int32, int64
* uint8, uint16, uint32, uint64
* float16, float32, float64, float128
* complex 64, 128, 256
* bool
* object
* string
* unicode

In [211]:
s = pd.Series({"z": 10, "b": 30}) # ordem natural da key

s

b    30
z    10
dtype: int64

In [212]:
s = pd.Series({"z": 10, 
               "b": 30,
               "a": 45,
               "x": 4}, index=['z', 'b', 'a', 'x'])

s

z    10
b    30
a    45
x     4
dtype: int64

### Indexando

http://pandas.pydata.org/pandas-docs/stable/api.html#indexing-iteration

In [213]:
s['z'] # label indexing

10

In [214]:
s.iloc[1] # integer indexing

30

In [215]:
s.iloc[[1, 0]] # mais de um valor

b    30
z    10
dtype: int64

In [216]:
s[[True, False, True, False]] # boolean indexing

z    10
a    45
dtype: int64

In [217]:
s.iloc[1:3] # do índice 1 ao índice 3 - 1 = 2

b    30
a    45
dtype: int64

In [218]:
s.iloc[2:] # até o fim

a    45
x     4
dtype: int64

In [219]:
s.iloc[:2] # até o 2 - 1

z    10
b    30
dtype: int64

In [220]:
s['b':'a'] # label slice inclui ambos os extremos!

b    30
a    45
dtype: int64

In [221]:
s[::-1]

x     4
a    45
b    30
z    10
dtype: int64

### Operações com primitivas

In [222]:
s

z    10
b    30
a    45
x     4
dtype: int64

In [223]:
s + 10

z    20
b    40
a    55
x    14
dtype: int64

In [224]:
s - 5

z     5
b    25
a    40
x    -1
dtype: int64

In [225]:
s * 2

z    20
b    60
a    90
x     8
dtype: int64

In [226]:
s < 20 # ver que é retornada series de boolean > pode ser utilizada como indexador!

z     True
b    False
a    False
x     True
dtype: bool

### Operações entre series

In [227]:
a = pd.Series(np.arange(0, 5))
b = pd.Series(np.arange(10, 15))

a
b

0    0
1    1
2    2
3    3
4    4
dtype: int64

0    10
1    11
2    12
3    13
4    14
dtype: int64

In [228]:
a + b

0    10
1    12
2    14
3    16
4    18
dtype: int64

In [229]:
a * b

0     0
1    11
2    24
3    39
4    56
dtype: int64

### Filtrando

In [230]:
s < 20

z     True
b    False
a    False
x     True
dtype: bool

In [231]:
s[s < 20]

z    10
x     4
dtype: int64

### Alinhamento

In [232]:
a = pd.Series({"a": 10, 
               "b": 30})
b = pd.Series({"b": 50, 
               "c": 10})

a + b

a     NaN
b    80.0
c     NaN
dtype: float64

### UFuncs

Funções que são aplicadas a todos elementos de um array.

In [233]:
a = pd.Series(np.random.randint(-100, 100, 10))

a

0    32
1     8
2   -18
3    62
4   -89
5   -66
6   -27
7    34
8    68
9   -81
dtype: int64

In [234]:
a.sum()

-77

In [235]:
a.mean()

-7.7

In [236]:
a.describe()

count    10.000000
mean     -7.700000
std      57.744745
min     -89.000000
25%     -56.250000
50%      -5.000000
75%      33.500000
max      68.000000
dtype: float64

In [237]:
a.abs()

0    32
1     8
2    18
3    62
4    89
5    66
6    27
7    34
8    68
9    81
dtype: int64

## DataFrame

http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html

Estrutura similar a um dicionário de Series. Possui tanto um índice para linhas quanto para colunas.

In [238]:
data = {"nome": ["Abelardo", "Juliana", "Rodesbaldo"],
        "idade": [27, 29, 88],
        "profissão": ["Anapropégua", "Médico", "Ditador"]}

df = pd.DataFrame(data)

df
# colunas em ordem natural

   idade        nome    profissão
0     27    Abelardo  Anapropégua
1     29     Juliana       Médico
2     88  Rodesbaldo      Ditador

In [239]:
df.T # transposta

                     0        1           2
idade               27       29          88
nome          Abelardo  Juliana  Rodesbaldo
profissão  Anapropégua   Médico     Ditador

In [240]:
pd.DataFrame(data, 
             columns=["nome", "idade", "profissão", "salário"], 
             index=["um", "dois", "três"]) # ordem de colunas = especificada

            nome  idade    profissão salário
um      Abelardo     27  Anapropégua     NaN
dois     Juliana     29       Médico     NaN
três  Rodesbaldo     88      Ditador     NaN

In [241]:
df.nome # selecionando coluna - notação apenas válida se o nome da coluna for um identificador válido python

0      Abelardo
1       Juliana
2    Rodesbaldo
Name: nome, dtype: object

In [242]:
df['nome'] # selecionando coluna

0      Abelardo
1       Juliana
2    Rodesbaldo
Name: nome, dtype: object

In [243]:
df[1:2] # para indexação de linhas, preferido df.iloc/loc
df.iloc[1:2, :]

   idade     nome profissão
1     29  Juliana    Médico

   idade     nome profissão
1     29  Juliana    Médico

In [244]:
df[::2]

   idade        nome    profissão
0     27    Abelardo  Anapropégua
2     88  Rodesbaldo      Ditador

In [245]:
df['random'] = np.random.randn(3)

df

   idade        nome    profissão    random
0     27    Abelardo  Anapropégua -1.471348
1     29     Juliana       Médico  0.647176
2     88  Rodesbaldo      Ditador  0.629334

### Alterando o dataframe

In [246]:
df.iloc[0] = pd.Series({"nome": "Josberto", 
              "idade": 99, 
              "profissão": "faz tudo",
              "random": .4}) # update

df

   idade        nome profissão    random
0     99    Josberto  faz tudo  0.400000
1     29     Juliana    Médico  0.647176
2     88  Rodesbaldo   Ditador  0.629334

In [247]:
df['salario'] = pd.Series([0, 20000, 10**7], index = [0, 1, 2]) # coluna

df

   idade        nome profissão    random   salario
0     99    Josberto  faz tudo  0.400000         0
1     29     Juliana    Médico  0.647176     20000
2     88  Rodesbaldo   Ditador  0.629334  10000000

In [248]:
del df['salario'] # removendo coluna

df

   idade        nome profissão    random
0     99    Josberto  faz tudo  0.400000
1     29     Juliana    Médico  0.647176
2     88  Rodesbaldo   Ditador  0.629334

In [249]:
df['is_random_gt_0'] = df.random > 0 # boolean series

df

   idade        nome profissão    random  is_random_gt_0
0     99    Josberto  faz tudo  0.400000            True
1     29     Juliana    Médico  0.647176            True
2     88  Rodesbaldo   Ditador  0.629334            True

## Axis

Axis = 0 -> rows

Axis = 1 -> columns

In [250]:
df.drop(0, axis=0) # 0=label, não inplace
# axis=0 default

   idade        nome profissão    random  is_random_gt_0
1     29     Juliana    Médico  0.647176            True
2     88  Rodesbaldo   Ditador  0.629334            True

In [251]:
df.drop("nome", axis=1)

   idade profissão    random  is_random_gt_0
0     99  faz tudo  0.400000            True
1     29    Médico  0.647176            True
2     88   Ditador  0.629334            True

In [252]:
nuns = pd.DataFrame(np.arange(9).reshape(3, 3), index=['a', 'b', 'c'], columns=['x', 'y', 'z'])

nuns

   x  y  z
a  0  1  2
b  3  4  5
c  6  7  8

In [253]:
nuns.sum(axis=0) # soma as linhas

x     9
y    12
z    15
dtype: int64

In [254]:
nuns.sum(axis=1) # soma as colunas

a     3
b    12
c    21
dtype: int64

In [255]:
# nova versão do pandas permite passar o nome do axis
nuns.sum(axis="index")
nuns.sum(axis="columns")

x     9
y    12
z    15
dtype: int64

a     3
b    12
c    21
dtype: int64

## Filtrando

In [257]:
ff = df.copy()
ff.index = ['a', 'b', 'c']
ff['idade'] = [20, 50, 80]
ff

   idade        nome profissão    random  is_random_gt_0
a     20    Josberto  faz tudo  0.400000            True
b     50     Juliana    Médico  0.647176            True
c     80  Rodesbaldo   Ditador  0.629334            True

In [258]:
ff['idade']

a    20
b    50
c    80
Name: idade, dtype: int64

In [259]:
ff.loc['a', 'idade'] # valor da 'célula'

20

In [260]:
ff.loc['a', ['idade']] # series com nome 'a' e valor correspondente da coluna 'idade'

idade    20
Name: a, dtype: object

In [261]:
ff.loc[['a'], ['idade']] # dataframe

   idade
a     20

In [262]:
ff.loc[['a'], 'idade'] # series com nome 'idade' e valor correspondente para a linha 'a'

a    20
Name: idade, dtype: int64

In [263]:
ff.loc['a', ['idade', 'nome']]

idade          20
nome     Josberto
Name: a, dtype: object

In [264]:
ff.iloc[1] # series

idade                   50
nome               Juliana
profissão           Médico
random            0.647176
is_random_gt_0        True
Name: b, dtype: object

In [265]:
ff.iloc[[1]] # dataframe

   idade     nome profissão    random  is_random_gt_0
b     50  Juliana    Médico  0.647176            True

In [266]:
ff.loc[['a', 'b'], 'idade']

a    20
b    50
Name: idade, dtype: int64

In [267]:
ff.loc[['a', 'b'], ['idade']]

   idade
a     20
b     50

In [268]:
ff

   idade        nome profissão    random  is_random_gt_0
a     20    Josberto  faz tudo  0.400000            True
b     50     Juliana    Médico  0.647176            True
c     80  Rodesbaldo   Ditador  0.629334            True

In [269]:
ff.idade < 50

a     True
b    False
c    False
Name: idade, dtype: bool

In [270]:
ff[ff.idade < 50]

   idade      nome profissão  random  is_random_gt_0
a     20  Josberto  faz tudo     0.4            True

In [271]:
ff.loc[lambda row: row.idade < 50, :] # útil para quando não se quer guardar um df temporário em uma variável

   idade      nome profissão  random  is_random_gt_0
a     20  Josberto  faz tudo     0.4            True

In [272]:
ff.loc[ff.idade < 28, ::-1]

   is_random_gt_0  random profissão      nome  idade
a            True     0.4  faz tudo  Josberto     20

In [273]:
ff

   idade        nome profissão    random  is_random_gt_0
a     20    Josberto  faz tudo  0.400000            True
b     50     Juliana    Médico  0.647176            True
c     80  Rodesbaldo   Ditador  0.629334            True

In [274]:
ff.loc['a':'b'] # inclusos os limites

   idade      nome profissão    random  is_random_gt_0
a     20  Josberto  faz tudo  0.400000            True
b     50   Juliana    Médico  0.647176            True

In [275]:
ff.loc[:, 'nome':'random']

         nome profissão    random
a    Josberto  faz tudo  0.400000
b     Juliana    Médico  0.647176
c  Rodesbaldo   Ditador  0.629334

In [276]:
ff.loc['a':'b', 'idade'] = 88
ff

   idade        nome profissão    random  is_random_gt_0
a     88    Josberto  faz tudo  0.400000            True
b     88     Juliana    Médico  0.647176            True
c     80  Rodesbaldo   Ditador  0.629334            True

In [277]:
ff.iloc[0]

idade                   88
nome              Josberto
profissão         faz tudo
random                 0.4
is_random_gt_0        True
Name: a, dtype: object

In [278]:
ff.iloc[-1]

idade                     80
nome              Rodesbaldo
profissão            Ditador
random              0.629334
is_random_gt_0          True
Name: c, dtype: object

In [279]:
ff.iloc[-3]

idade                   88
nome              Josberto
profissão         faz tudo
random                 0.4
is_random_gt_0        True
Name: a, dtype: object

In [280]:
ff

   idade        nome profissão    random  is_random_gt_0
a     88    Josberto  faz tudo  0.400000            True
b     88     Juliana    Médico  0.647176            True
c     80  Rodesbaldo   Ditador  0.629334            True

In [281]:
%%timeit 

ff.get_value('b', 'profissão')

The slowest run took 59.52 times longer than the fastest. This could mean that an intermediate result is being cached.
100000 loops, best of 3: 2.02 µs per loop

In [282]:
%%timeit

ff.loc['b', 'profissão']

The slowest run took 15.67 times longer than the fastest. This could mean that an intermediate result is being cached.
100000 loops, best of 3: 7.33 µs per loop

In [283]:
_ = ff.set_value('b', 'profissão', 'Geriatra')

ff

   idade        nome profissão    random  is_random_gt_0
a     88    Josberto  faz tudo  0.400000            True
b     88     Juliana  Geriatra  0.647176            True
c     80  Rodesbaldo   Ditador  0.629334            True

## Aritmética

In [284]:
s1 = pd.Series(np.random.randint(0, 100, 5), index=range(5))
s2 = pd.Series(np.random.randint(-10, 0, 5), index=range(0, 10, 2))

s1
s2

0    88
1    59
2    77
3    63
4    67
dtype: int64

0   -7
2   -6
4   -1
6   -2
8   -4
dtype: int64

In [285]:
s1+s2

0    81.0
1     NaN
2    71.0
3     NaN
4    66.0
6     NaN
8     NaN
dtype: float64

In [286]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'), 
                   index=['Fortaleza', 'São Paulo', 'Rio de Janeiro'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'), 
                   index=['Utah', 'Fortaleza', 'São Paulo', 'Crateús'])

df1
df2

                  b    c    d
Fortaleza       0.0  1.0  2.0
São Paulo       3.0  4.0  5.0
Rio de Janeiro  6.0  7.0  8.0

             b     d     e
Utah       0.0   1.0   2.0
Fortaleza  3.0   4.0   5.0
São Paulo  6.0   7.0   8.0
Crateús    9.0  10.0  11.0

In [287]:
df1+df2 # op(x, y) = NaN if x = NaN or y = NaN
# - * /

                  b   c     d   e
Crateús         NaN NaN   NaN NaN
Fortaleza       3.0 NaN   6.0 NaN
Rio de Janeiro  NaN NaN   NaN NaN
São Paulo       9.0 NaN  12.0 NaN
Utah            NaN NaN   NaN NaN

In [288]:
df1.add(df2, fill_value=0) # usa 0 para missing values
# sub, div, mul, add

                  b    c     d     e
Crateús         9.0  NaN  10.0  11.0
Fortaleza       3.0  1.0   6.0   5.0
Rio de Janeiro  6.0  7.0   8.0   NaN
São Paulo       9.0  4.0  12.0   8.0
Utah            0.0  NaN   1.0   2.0

# DataFrame e Series

In [289]:
df1

                  b    c    d
Fortaleza       0.0  1.0  2.0
São Paulo       3.0  4.0  5.0
Rio de Janeiro  6.0  7.0  8.0

In [290]:
rj = df1.loc['Rio de Janeiro']
rj

b    6.0
c    7.0
d    8.0
Name: Rio de Janeiro, dtype: float64

In [291]:
df1 - rj

                  b    c    d
Fortaleza      -6.0 -6.0 -6.0
São Paulo      -3.0 -3.0 -3.0
Rio de Janeiro  0.0  0.0  0.0

In [292]:
ore = pd.Series(range(3), index=['b', 'd', 'e'])

df1+ore

                  b   c    d   e
Fortaleza       0.0 NaN  3.0 NaN
São Paulo       3.0 NaN  6.0 NaN
Rio de Janeiro  6.0 NaN  9.0 NaN

In [293]:
b = df1.loc[:, 'b']
b

Fortaleza         0.0
São Paulo         3.0
Rio de Janeiro    6.0
Name: b, dtype: float64

In [294]:
df1+b # soma é rowise

                Fortaleza  Rio de Janeiro  São Paulo   b   c   d
Fortaleza             NaN             NaN        NaN NaN NaN NaN
São Paulo             NaN             NaN        NaN NaN NaN NaN
Rio de Janeiro        NaN             NaN        NaN NaN NaN NaN

In [295]:
df1.add(b, axis=0) # matches b index labels with df1 index labels(axis=0)

                   b     c     d
Fortaleza        0.0   1.0   2.0
São Paulo        6.0   7.0   8.0
Rio de Janeiro  12.0  13.0  14.0

## Functions

In [296]:
df = pd.DataFrame(np.random.randn(4, 3), 
                  columns=list('abc'), 
                  index=['DSI', 'DADM', 'DSM', 'DPU'])

df

             a         b         c
DSI  -1.295952  0.477077 -0.118731
DADM -1.802248  0.261089 -0.689736
DSM   0.505697 -0.738984 -0.608123
DPU   0.672216 -0.540058  0.467781

In [297]:
df.apply(lambda x: x.max() - x.min())
# por default reduz axis = 0 -> apply function to each column

a    2.474464
b    1.216061
c    1.157517
dtype: float64

In [298]:
df.apply(lambda x: x.max() - x.min(), axis=1)

DSI     1.773029
DADM    2.063338
DSM     1.244681
DPU     1.212274
dtype: float64

In [299]:
df.apply(lambda x: pd.Series([x.min(), x.max(), x.max() - x.min()], 
                             index=['min', 'max', 'range']))

              a         b         c
min   -1.802248 -0.738984 -0.689736
max    0.672216  0.477077  0.467781
range  2.474464  1.216061  1.157517

In [300]:
df.applymap(lambda x: "{0:.2f}".format(x)) # dataframe

          a      b      c
DSI   -1.30   0.48  -0.12
DADM  -1.80   0.26  -0.69
DSM    0.51  -0.74  -0.61
DPU    0.67  -0.54   0.47

In [301]:
df.a.map(lambda x: "{0:.2f}".format(x)) # series

DSI     -1.30
DADM    -1.80
DSM      0.51
DPU      0.67
Name: a, dtype: object

## Sorting

In [302]:
s = pd.Series(np.random.randint(-10, 10, 4), index=list('dabc'))

s

d   -3
a    9
b    3
c   -8
dtype: int64

In [303]:
s.sort_index()

a    9
b    3
c   -8
d   -3
dtype: int64

In [304]:
s.sort_values() # parametro ascending=False para ordenar do maior para o menor

c   -8
d   -3
b    3
a    9
dtype: int64

In [305]:
df = pd.DataFrame(np.arange(12).reshape((3, 4)), 
                  index=['três', 'dois', 'sete'], 
                  columns=list('dabc'))

df

      d  a   b   c
três  0  1   2   3
dois  4  5   6   7
sete  8  9  10  11

In [306]:
df.sort_index()

      d  a   b   c
dois  4  5   6   7
sete  8  9  10  11
três  0  1   2   3

In [307]:
df.sort_index(axis=1) # como tem 2 index, pode-se especificar o index das colunas

      a   b   c  d
três  1   2   3  0
dois  5   6   7  4
sete  9  10  11  8

In [308]:
df.sort_index(axis=1, ascending=False)

      d   c   b  a
três  0   3   2  1
dois  4   7   6  5
sete  8  11  10  9

In [309]:
df.sort_values('a', ascending=False) # ordenar pela coluna 'a' ascending=False

      d  a   b   c
sete  8  9  10  11
dois  4  5   6   7
três  0  1   2   3

In [310]:
df.sort_values(['a', 'b'], ascending=[False, True]) # ordenar pelas colunas 'a' e 'b', desc, asc

      d  a   b   c
sete  8  9  10  11
dois  4  5   6   7
três  0  1   2   3

## Summarizing

In [336]:
df = pd.DataFrame({'1': [1.4, 7.1, np.nan, .75], 
                   '2': [np.nan, -4.5, np.nan, -1.3],
                   '3': [True, False, True, True]},
                  index=list('abcd'))

df

      1    2      3
a  1.40  NaN   True
b  7.10 -4.5  False
c   NaN  NaN   True
d  0.75 -1.3   True

In [337]:
df.sum() # soma linhas

1    9.25
2   -5.80
3    3.00
dtype: float64

In [338]:
df.sum(skipna=False) # se houver NaN, resultado é NaN

1    NaN
2    NaN
3    3.0
dtype: float64

In [339]:
df.sum(axis=1) # soma colunas

a    2.40
b    2.60
c    1.00
d    0.45
dtype: float64

In [340]:
df.mean(axis=1, skipna=False) # média dos valores das linhas

a         NaN
b    0.866667
c         NaN
d    0.150000
dtype: float64

In [341]:
df.idxmax() # índice em axis = 0 com maiores valores

1    b
2    d
3    a
dtype: object

In [342]:
df['1'].argmin() # label cujo valor na coluna 1 é o mínimo

'd'

In [344]:
df.cumsum() # soma cumulativa

      1    2     3
a   1.4  NaN  True
b   8.5 -4.5     1
c   NaN  NaN     2
d  9.25 -5.8     3

In [345]:
df.cumsum(skipna=False) # sem skipna

     1    2     3
a  1.4  NaN  True
b  8.5  NaN     1
c  NaN  NaN     2
d  NaN  NaN     3

In [346]:
df.describe() # método que retorna valores estatísticos

              1         2
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [347]:
df['3'].any()

True

In [348]:
df['3'].all()

False

In [321]:
s = pd.Series(list('aabc')*4)

s

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [322]:
s.describe() # colunas não numéricas

count     16
unique     3
top        a
freq       8
dtype: object

In [323]:
df.count() # quantidade de non-NA values

1    3
2    2
dtype: int64

In [324]:
df = pd.DataFrame(np.arange(10).reshape((5, 2)))

df

   0  1
0  0  1
1  2  3
2  4  5
3  6  7
4  8  9

In [325]:
df.quantile() # valores abaixo dos quais se concentram 50% dos dados
# possível gerar outras configurações de quantiles, como [-inf, 0., 0.5, inf]

0    4.0
1    5.0
Name: 0.5, dtype: float64

In [326]:
df.quantile(q=[0., 0.5, 1])

       0    1
0.0  0.0  1.0
0.5  4.0  5.0
1.0  8.0  9.0

In [327]:
df.mean() # sum/count - por default, exclui NAs!

0    4.0
1    5.0
dtype: float64

In [328]:
df = pd.DataFrame({'a': [1, 2, 3, None], 'b': [1, 2, 3, 0]})
df.mean() # mean(skipna=True) > não conta o NA no count

a    2.0
b    1.5
dtype: float64

In [329]:
df.median() # valor abaixo do qual se concentram 50% dos dados

a    2.0
b    1.5
dtype: float64

In [330]:
df.std() # standard deviation

a    1.000000
b    1.290994
dtype: float64

# Set operations

In [349]:
n = pd.Series(['Brasil', "USA", "UK", "Argentina", "Brasil"])

n

0       Brasil
1          USA
2           UK
3    Argentina
4       Brasil
dtype: object

In [350]:
n.unique()

array(['Brasil', 'USA', 'UK', 'Argentina'], dtype=object)

In [352]:
n.isin(['Brasil', 'Argentina'])

0     True
1    False
2    False
3     True
4     True
dtype: bool

In [353]:
np.intersect1d(n, ['Brasil', 'Japão'])

array(['Brasil'], dtype=object)

In [354]:
np.union1d(n, ['Japão', 'África do Sul'])

array(['Argentina', 'Brasil', 'Japão', 'UK', 'USA', 'África do Sul'], dtype=object)

In [355]:
np.setdiff1d(n, ['Japão', 'Brasil', 'USA'])

array(['Argentina', 'UK'], dtype=object)

In [356]:
np.setxor1d(n, ['Japão', 'Brasil', 'USA'])

array(['Argentina', 'Japão', 'UK'], dtype=object)

# Outras

In [331]:
df.cumsum()

     a    b
0  1.0  1.0
1  3.0  3.0
2  6.0  6.0
3  NaN  6.0

In [332]:
df.cummin()

     a    b
0  1.0  1.0
1  1.0  1.0
2  1.0  1.0
3  NaN  0.0

In [333]:
df.cummax()

     a    b
0  1.0  1.0
1  2.0  2.0
2  3.0  3.0
3  NaN  3.0

In [334]:
quads = pd.DataFrame({i:[i for _ in range(7)] for i in range(7)}).cumprod()

quads

   0  1    2     3      4      5       6
0  0  1    2     3      4      5       6
1  0  1    4     9     16     25      36
2  0  1    8    27     64    125     216
3  0  1   16    81    256    625    1296
4  0  1   32   243   1024   3125    7776
5  0  1   64   729   4096  15625   46656
6  0  1  128  2187  16384  78125  279936

In [335]:
quads.pct_change()

    0    1    2    3    4    5    6
0 NaN  NaN  NaN  NaN  NaN  NaN  NaN
1 NaN  0.0  1.0  2.0  3.0  4.0  5.0
2 NaN  0.0  1.0  2.0  3.0  4.0  5.0
3 NaN  0.0  1.0  2.0  3.0  4.0  5.0
4 NaN  0.0  1.0  2.0  3.0  4.0  5.0
5 NaN  0.0  1.0  2.0  3.0  4.0  5.0
6 NaN  0.0  1.0  2.0  3.0  4.0  5.0